src/InformationRegisters/ШтрихкодыНаПроизводстве/ШтрихкодыНаПроизводстве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНаПроизводстве</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиНаПроизводстве</types>
    </type>
  </resources>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Процесс</name>
    <type>
      <types>EnumRef.ПроцессНаПроизводстве</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>31</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/Производство/Module.bsl
// @strict-types
#Область ПрограммныйИнтерфейс

// Функция определяет количество штрихкодов, обработанных данным сотрудником.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.СотрудникиНаПроизводстве
//  Процесс - ПеречислениеСсылка.ПроцессНаДесме
// 
// Возвращаемое значение:
//  Число
Функция КоличествоШтрихкодовСотрудника(Знач Сотрудник, Знач Процесс) Экспорт

    Запрос = Новый Запрос("ВЫБРАТЬ
                          |    КОЛИЧЕСТВО(*) КАК Количество
                          |ИЗ
                          |    РегистрСведений.ШтрихкодыНаПроизводстве КАК ШтрихкодыНаПроизводстве
                          |ГДЕ
                          |    НЕ ШтрихкодыНаПроизводстве.Обработан
                          |    И ШтрихкодыНаПроизводстве.Сотрудник = &Сотрудник
                          |    И ШтрихкодыНаПроизводстве.Процесс = &Процесс");

    Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
    Запрос.УстановитьПараметр("Процесс", Процесс);

    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();

    Если Не Выборка.Следующий() Тогда

        Возврат 0;

    КонецЕсли;
    
    //@skip-check property-return-type
    КоличествоШтрихкодов = Выборка.Количество; // Число

    Возврат КоличествоШтрихкодов;

КонецФункции

// Функция определяет был ли уже отсканирован штрихкод, и если нет,
// то сохраняет его.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.СотрудникиНаПроизводстве
//  Процесс - ПеречислениеСсылка.ПроцессНаПроизводстве
//  Штрихкод - Строка
// 
// Возвращаемое значение:
//  См. НовоеОписаниеОбработкиШтрихкода
Функция ОбработатьШтрихкод(Знач Сотрудник, Знач Процесс, Знач Штрихкод) Экспорт
    
    // 1. Удаление недопустимых символов из штрихкода, чтобы в базу данных не попала строка, которую нельзя сериализовать
    Штрихкод = XMLКлиентСервер.ЗаменитьНедопустимыеСимволы(Штрихкод);

    НачатьТранзакцию();

    Попытка

        ОписаниеОбработкиШтрихкода = НовоеОписаниеОбработкиШтрихкода();
        
        // 2. Проверка, что штрихкод еще не был отсканирован
        Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                              |    ШтрихкодыНаПроизводстве.Дата,
                              |    ШтрихкодыНаПроизводстве.Сотрудник
                              |ИЗ
                              |    РегистрСведений.ШтрихкодыНаПроизводстве КАК ШтрихкодыНаПроизводстве
                              |ГДЕ
                              |    ШтрихкодыНаПроизводстве.Процесс = &Процесс
                              |    И ШтрихкодыНаПроизводстве.Штрихкод = &Штрихкод");

        Запрос.УстановитьПараметр("Процесс", Процесс);
        Запрос.УстановитьПараметр("Штрихкод", Лев(Штрихкод,
                                                  Метаданные.РегистрыСведений.ШтрихкодыНаПроизводстве.Измерения.Штрихкод.Тип.КвалификаторыСтроки.Длина));

        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();

        Если Выборка.Следующий() Тогда

            ОтменитьТранзакцию();

            //@skip-check property-return-type
            ДатаПредыдущегоСканирования = Выборка.Дата; // Дата
            
            //@skip-check property-return-type
            СотрудникПредыдущегоСканирования = Выборка.Сотрудник; // СправочникСсылка.СотрудникиНаПроизводстве

            ОписаниеОбработкиШтрихкода.ДатаПредыдущегоСканирования = ДатаПредыдущегоСканирования;
            ОписаниеОбработкиШтрихкода.СотрудникПредыдущегоСканирования = СотрудникПредыдущегоСканирования;
            ОписаниеОбработкиШтрихкода.КодВозврата = ?(СотрудникПредыдущегоСканирования = Сотрудник,
                                                       КодВозвратаШтрихкодУжеОтсканирован(),
                                                       КодВозвратаШтрихкодУжеОтсканированДругим());

            Возврат ОписаниеОбработкиШтрихкода;

        КонецЕсли;
  
        // 3. Добавление штрихкода в документ и регистр сведений
        РегистрыСведений.ШтрихкодыНаПроизводстве.ДобавитьШтрихкод(Процесс, Сотрудник, Штрихкод, ТекущаяДатаСеанса());

        ОписаниеОбработкиШтрихкода.КодВозврата = КодВозвратаУспех();

        ЗафиксироватьТранзакцию();

        Возврат ОписаниеОбработкиШтрихкода;

    Исключение

        ОтменитьТранзакцию();
        ВызватьИсключение;

    КонецПопытки;

КонецФункции

// См. РегистрСведенийМенеджер.ШтрихкодыНаПроизводстве.УдалитьШтрихкод
Процедура УдалитьШтрихкод(Знач Сотрудник, Знач Процесс, Знач Штрихкод) Экспорт

    РегистрыСведений.ШтрихкодыНаПроизводстве.УдалитьШтрихкод(Процесс, Сотрудник, Штрихкод);

КонецПроцедуры

// См. РегистрСведенийМенеджер.ШтрихкодыНаПроизводстве.УдалитьШтрихкодыСотрудника
Процедура УдалитьШтрихкодыСотрудника(Знач Сотрудник, Знач Процесс) Экспорт

    РегистрыСведений.ШтрихкодыНаПроизводстве.УдалитьШтрихкодыСотрудника(Процесс, Сотрудник);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция создает описание обработки штрихкода.
// 
// Возвращаемое значение:
//  Структура - Описание обработки штрихкода:
// * КодВозврата - Число - Код, указывающий на результат обработки штрихкода
// * ДатаПредыдущегоСканирования - Неопределено, Дата - Дата предыдущего сканирования, если штрихкод уже был отсканирован
// * СотрудникПредыдущегоСканирования - Неопределено, СправочникСсылка.СотрудникиНаПроизводстве - Сотудник, уже отсканировавший штрихкод
Функция НовоеОписаниеОбработкиШтрихкода() Экспорт

    ОписаниеОбработкиШтрихкода = Новый Структура;

    ОписаниеОбработкиШтрихкода.Вставить("КодВозврата", КодВозвратаУспех());
    ОписаниеОбработкиШтрихкода.Вставить("ДатаПредыдущегоСканирования", Неопределено);
    ОписаниеОбработкиШтрихкода.Вставить("СотрудникПредыдущегоСканирования", Неопределено);

    Возврат ОписаниеОбработкиШтрихкода;

КонецФункции

#КонецОбласти
